# 4. MyDream 앱

~~~
1. Label
2. ImageView
3. TextView
4. LaunchScreen
5. EntryPoint
6. 이미지 해상도
~~~

## 4.1 Label
* 왠만한 설정은 옆의 utility 또는 nevigator 살펴보면 알 수 있었다. 
* 배경색, 폰트, 그림자등의 설정등이 있었다.
* 라벨 창을 줄이면 자동으로 작아지거나 잘리는 기능들을 세부적으로 조절이 가능했다.
* 잘리는 기능은 예를들어 단어마다 또는 한글자마다 등이 있었다.

## 4.2 ImageView 
* Assets.xcassets 폴더에 이미지를 넣어둔다.
* ImageView 컨트롤을 추가한 후 폴더에 넣어둔 이미지가 자동적으로 선택될 수 있게 나타난다.

## 4.3 TextView
* 긴 글을 적을때 사용되는 컨트롤이다.
* 안에 전화번호 또는 링크등을 설정할 수 있었다.
* 사용자가 직접 편집을 할 수 있게 편집가능 기능 여부를 설정할 수 있었다.
* 스크롤 기능도 추가적으로 설정이 가능했다.

## 4.4 LaunchScreen
* 처음 시작할때 나타나는 화면을 설정할 수 있다.

## 4.5 EntryPoint 
* LaunchScreen 다음에 나타날 창을 표시한다.
* 화살표 모양이 그것이다.
* 화살표 모양을 삭제할 경우 유틸리티 창에서 다시 나타낼 수 있다.

## 4.6 이미지 해상도
* 이미지 해상도의 경우 각 픽셀별로 모두 저장하는 것이 좋다. 
* 기기마다 다른 픽셀이 자동적으로 결정되기 때문이다.
